# Contains Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupSet..::..Contains Method
GroupSet Class See Also
---
Tests for the existence of a group within the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Contains(
	Group item
)
```

Visual Basic
---
```text
Public Overridable Function Contains ( _
	item As Group _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Contains(
	Group^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..GroupThe group to be searched for.
# ### Return Value
The Contains method returns True if the group is within the set, otherwise False.
# See Also
GroupSet Class
Autodesk.Revit.DB Namespace